// generateMaze関数の定義
export function generateMaze(width, height) {
    let maze = new Array(height);
    for (let y = 0; y < height; y++) {
        maze[y] = new Array(width).fill(0); // 全て通路で初期化
    }

    if (window.gameState === 'playing' || window.gameState === 'victory') {
        // 迷路の外周一周壁を設定
        for (let y = 0; y < height; y++) {
            maze[y][0] = 1; // 左端に壁を設定
            maze[y][width - 1] = 1; // 右端に壁を設定
        }
        for (let x = 0; x < width; x++) {
            maze[0][x] = 1; // 上端に壁を設定
            maze[height - 1][x] = 1; // 下端に壁を設定
        }
        // 特定の位置の壁を取り除く
        maze[8][0] = 0; // (0,8)の壁を取り除く
        maze[9][0] = 0; // (0,9)の壁を取り除く
        maze[8][width - 1] = 0; // (50,8)の壁を取り除く
        maze[9][width - 1] = 0; // (50,9)の壁を取り除く

        // 指定された位置に壁を設定
        maze[7][1] = 1;
        maze[10][1] = 1;
        maze[7][width - 2] = 1;
        maze[10][width - 2] = 1;

    } else {
        // 迷路の外周一周壁を設定
        for (let y = 0; y < height; y++) {
            maze[y][0] = 1; // 左端に壁を設定
            maze[y][width - 1] = 1; // 右端に壁を設定
        }
        for (let x = 0; x < width; x++) {
            maze[0][x] = 1; // 上端に壁を設定
            maze[height - 1][x] = 1; // 下端に壁を設定
        }
    }

    // C------------------------------------------------
    // x5,y4からx6,y13まで壁に変更
    for (let y = 4; y <= 13; y++) {
        maze[y][5] = 1;
        maze[y][6] = 1;
    }
    // x7,y4からx12,y5まで壁に変更
    for (let x = 7; x <= 12; x++) {
        maze[4][x] = 1;
        maze[5][x] = 1;
    }
    // x7,y11からx12,y13まで壁に変更
    for (let y = 11; y <= 13; y++) {
        for (let x = 7; x <= 12; x++) {
            maze[y][x] = 1;
        }
    }
    // x14,y4からx16,y13まで壁に変更
    for (let y = 4; y <= 13; y++) {
        for (let x = 14; x <= 16; x++) {
            maze[y][x] = 1;
        }
    }
    // x17,y7からx19,y8まで壁に変更
    for (let y = 7; y <= 8; y++) {
        for (let x = 17; x <= 19; x++) {
            maze[y][x] = 1;
        }
    }
    // x18,y9からx19,y13まで壁に変更
    for (let y = 9; y <= 13; y++) {
        for (let x = 18; x <= 19; x++) {
            maze[y][x] = 1;
        }
    }

    // x21,y7からx22,y13まで壁に変更
    for (let y = 7; y <= 13; y++) {
        for (let x = 21; x <= 22; x++) {
            maze[y][x] = 1;
        }
    }
    // x23,y7からx26,y7まで壁に変更
    for (let x = 23; x <= 26; x++) {
        maze[7][x] = 1;
    }
    // x23,y9からx26,y10まで壁に変更
    for (let y = 9; y <= 10; y++) {
        for (let x = 23; x <= 26; x++) {
            maze[y][x] = 1;
        }
    }
    // x23,y12からx26,y13まで壁に変更
    for (let y = 12; y <= 13; y++) {
        for (let x = 23; x <= 26; x++) {
            maze[y][x] = 1;
        }
    }

    // E------------------------------------------------
    // x28,y7からx29,y13まで壁に変更
    for (let y = 7; y <= 13; y++) {
        for (let x = 28; x <= 29; x++) {
            maze[y][x] = 1;
        }
    }
    // x30,y7からx33,y7まで壁に変更
    for (let x = 30; x <= 33; x++) {
        maze[7][x] = 1;
    }
    // x30,y9からx33,y10まで壁に変更
    for (let y = 9; y <= 10; y++) {
        for (let x = 30; x <= 33; x++) {
            maze[y][x] = 1;
        }
    }
    // x30,y12からx33,y13まで壁に変更
    for (let y = 12; y <= 13; y++) {
        for (let x = 30; x <= 33; x++) {
            maze[y][x] = 1;
        }
    }

    // S------------------------------------------------
    // x35,y7からx36,y10まで壁に変更
    for (let y = 7; y <= 10; y++) {
        for (let x = 35; x <= 36; x++) {
            maze[y][x] = 1;
        }
    }

    // x37,y7からx39,y7まで壁に変更
    for (let x = 37; x <= 39; x++) {
        maze[7][x] = 1;
    }

    // x37,y9からx39,y10まで壁に変更
    for (let y = 9; y <= 10; y++) {
        for (let x = 37; x <= 39; x++) {
            maze[y][x] = 1;
        }
    }

    // x35,y12からx39,y13まで壁に変更
    for (let y = 12; y <= 13; y++) {
        for (let x = 35; x <= 39; x++) {
            maze[y][x] = 1;
        }
    }

    // x38,y11からx39,y11まで壁に変更
    for (let x = 38; x <= 39; x++) {
        maze[11][x] = 1;
    }

    // E------------------------------------------------
    // x41,y7からx42,y13まで壁に変更
    for (let y = 7; y <= 13; y++) {
        for (let x = 41; x <= 42; x++) {
            maze[y][x] = 1;
        }
    }
    // x43,y7からx46,y7まで壁に変更
    for (let x = 43; x <= 46; x++) {
        maze[7][x] = 1;
    }
    // x43,y9からx46,y10まで壁に変更
    for (let y = 9; y <= 10; y++) {
        for (let x = 43; x <= 46; x++) {
            maze[y][x] = 1;
        }
    }
    // x43,y12からx46,y13まで壁に変更
    for (let y = 12; y <= 13; y++) {
        for (let x = 43; x <= 46; x++) {
            maze[y][x] = 1;
        }
    }

    //cheeseWallを生成-------------------------------------------------------

    // (3,7)から(3,10) まで、3を割り当て
    for (let y = 7; y <= 10; y++) {
        maze[y][3] = 3;
    }

    // (48,7)から(48,10) まで、3を割り当て
    for (let y = 7; y <= 10; y++) {
        maze[y][48] = 3;
    }

    // (2,2)から(3,5) まで、3を割り当て
    for (let y = 2; y <= 5; y++) {
        for (let x = 2; x <= 3; x++) {
            maze[y][x] = 3;
        }
    }

    // (2,12)から(3,15)、3を割り当て
    for (let y = 12; y <= 15; y++) {
        for (let x = 2; x <= 3; x++) {
            maze[y][x] = 3;
        }
    }

    // (4,2)から(12,2)、3を割り当て
    for (let x = 4; x <= 12; x++) {
        maze[2][x] = 3;
    }

    // (4,15)から(12,15)、3を割り当て
    for (let x = 4; x <= 12; x++) {
        maze[15][x] = 3;
    }

    // (8,7)から(12,9)、3を割り当て
    for (let y = 7; y <= 9; y++) {
        for (let x = 8; x <= 12; x++) {
            maze[y][x] = 3;
        }
    }

    // (14,15)から(26,15)、3を割り当て
    for (let x = 14; x <= 26; x++) {
        maze[15][x] = 3;
    }

    // (28,15)から(33,15)、3を割り当て
    for (let x = 28; x <= 33; x++) {
        maze[15][x] = 3;
    }

    // (35,15)から(39,15)、3を割り当て
    for (let x = 35; x <= 39; x++) {
        maze[15][x] = 3;
    }

    // (39,15)から(47,15)、3を割り当て
    for (let x = 39; x <= 47; x++) {
        maze[15][x] = 3;
    }

    // (48,15)から(49,12)、3を割り当て
    for (let y = 12; y <= 15; y++) {
        for (let x = 48; x <= 49; x++) {
            maze[y][x] = 3;
        }
    }

    // (14,2)から(19,2)、3を割り当て
    for (let x = 14; x <= 19; x++) {
        maze[2][x] = 3;
    }

    // (19,2)から(26,2)、3を割り当て
    for (let x = 19; x <= 26; x++) {
        maze[2][x] = 3;
    }

    // (28,2)から(33,5)、3を割り当て
    for (let y = 2; y <= 5; y++) {
        for (let x = 28; x <= 33; x++) {
            maze[y][x] = 3;
        }
    }


    // (35,2)から(39,5)、3を割り当て
    for (let y = 2; y <= 5; y++) {
        for (let x = 35; x <= 39; x++) {
            maze[y][x] = 3;
        }
    }

    // (41,2)から(46,2)、3を割り当て
    for (let x = 41; x <= 46; x++) {
        maze[2][x] = 3;
    }

    // (41,4)から(46,5)、3を割り当て
    for (let y = 4; y <= 5; y++) {
        for (let x = 41; x <= 46; x++) {
            maze[y][x] = 3;
        }
    }

    // (48,2)から(49,5)、3を割り当て
    for (let y = 2; y <= 5; y++) {
        for (let x = 48; x <= 49; x++) {
            maze[y][x] = 3;
        }
    }

    // (18,4)から(19,5)、3を割り当て
    for (let y = 4; y <= 5; y++) {
        for (let x = 18; x <= 19; x++) {
            maze[y][x] = 3;
        }
    }

    // (21,4)から(26,5)、3を割り当て
    for (let y = 4; y <= 5; y++) {
        for (let x = 21; x <= 26; x++) {
            maze[y][x] = 3;
        }
    }

    //------------------------------------------------------------------
    // (11,4)から(12,5)、2を割り当て
    for (let y = 4; y <= 5; y++) {
        for (let x = 11; x <= 12; x++) {
            maze[y][x] = 2;
        }
    }

    // (11,11)から(12,13)、2を割り当て
    for (let y = 11; y <= 13; y++) {
        for (let x = 11; x <= 12; x++) {
            maze[y][x] = 2;
        }
    }

    // (16,13)から(16,8)、2を割り当て
    for (let y = 8; y <= 13; y++) {
        maze[y][16] = 2;
    }

    // (17,8)、2を割り当て
    maze[8][17] = 2;

    // (18,13)から(18,8)、2を割り当て
    for (let y = 8; y <= 13; y++) {
        maze[y][18] = 2;
    }

    // (26,7)から(26,10)、2を割り当て
    for (let y = 7; y <= 10; y++) {
        maze[y][26] = 2;
    }
    // (26,12)、2を割り当て
    maze[12][26] = 2;
    // (26,13)、2を割り当て
    maze[13][26] = 2;

    // (28,13)から(28,7)、2を割り当て
    for (let y = 7; y <= 13; y++) {
        maze[y][28] = 2;
    }

    // (33,7)から(33,10)、2を割り当て
    for (let y = 7; y <= 10; y++) {
        maze[y][33] = 2;
    }
    // (33,12)、2を割り当て
    maze[12][33] = 2;
    // (33,13)、2を割り当て
    maze[13][33] = 2;

    // (41,13)から(41,7)、2を割り当て
    for (let y = 7; y <= 13; y++) {
        maze[y][41] = 2;
    }

    // (39,7)、2を割り当て
    maze[7][39] = 2;

    // (39,9)から(39,13)、2を割り当て
    for (let y = 9; y <= 13; y++) {
        maze[y][39] = 2;
    }

    // (35,7)から(35,10)、2を割り当て
    for (let y = 7; y <= 10; y++) {
        maze[y][35] = 2;
    }

    // (35,12)から(35,13)、2を割り当て
    for (let y = 12; y <= 13; y++) {
        maze[y][35] = 2;
    }

    // (46,7)から(46,10)、2を割り当て
    for (let y = 7; y <= 10; y++) {
        maze[y][46] = 2;
    }
    // (46,12)、2を割り当て
    maze[12][46] = 2;
    // (46,13)、2を割り当て
    maze[13][46] = 2;
    
    //----------------------------------------------------------------------------

    // (25,8)から(23,8)、4を割り当て
    for (let x = 23; x <= 25; x++) {
        maze[8][x] = 4;
    }

    // (32,8)から(30,8)、4を割り当て
    for (let x = 30; x <= 32; x++) {
        maze[8][x] = 4;
    }

    // (32,8)から(30,8)、4を割り当て
    for (let x = 30; x <= 32; x++) {
        maze[8][x] = 4;
    }
    // (45,8)から(43,8)、4を割り当て
    for (let x = 43; x <= 45; x++) {
        maze[8][x] = 4;
    }

    return maze;
}